In [2]:
import pandas as pd

In [ ]:
1.Find the numbere that are multiples of 3 from a given series.

In [13]:
df = pd.Series([2,3,4,5])
d = [x for x in df if x%3 ==0]
d

[3]

In [27]:
df%3

0    2
1    0
2    1
3    2
dtype: int64

In [42]:
d = pd.Series([2,3,4,5])
d%3==0

0    False
1     True
2    False
3    False
dtype: bool

In [43]:
d[d%3==0]

1    3
dtype: int64

In [12]:
ser = pd.Series(list("abcdefghijklmnopqrstuvwxyz"))
pos = [0,4,8,14,20]
ser

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [13]:
ser[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [65]:
ser = pd.DataFrame([["hello","say"],["python","good"],["morning","hi"],["boy","girl"],["data","type"]])
ser

         0     1
0    hello   say
1   python  good
2  morning    hi
3      boy  girl
4     data  type

In [45]:
ser[::-1]

         0     1
4     data  type
3      boy  girl
2  morning    hi
1   python  good
0    hello   say

In [58]:
ser.iloc[:5:1]

         0     1
0    hello   say
1   python  good
2  morning    hi
3      boy  girl
4     data  type

In [68]:
ser[[0,1]]=ser[[1,0]]
ser

      0        1
0   say    hello
1  good   python
2    hi  morning
3  girl      boy
4  type     data